In [4]:
import pandas as pd

In [5]:
df = pd.read_csv('name_score.csv')

In [6]:
df.head()

    Name   Score
0     Tom     75
1     Sam     95
2  James      98
3    Tina     74
4   Becca     80

In [7]:
df.describe()

           Score
count   7.000000
mean   80.142857
std    14.111799
min    56.000000
25%    74.500000
50%    80.000000
75%    89.000000
max    98.000000

In [8]:
df.shape

(7, 2)

In [9]:
df

    Name   Score
0     Tom     75
1     Sam     95
2  James      98
3    Tina     74
4   Becca     80
5  Dessa      83
6    Lena     56

In [10]:
df.columns

Index(['Name ', 'Score'], dtype='object')

In [11]:
df.columns = [
  'Name',
  'Score'
]

In [12]:
df.columns

Index(['Name', 'Score'], dtype='object')

In [13]:
df.rename(columns={'Name ':'name'}, inplace=True)

In [14]:
df.columns

Index(['Name', 'Score'], dtype='object')

In [15]:
df['Name'] = df['Name'].str.strip()

In [16]:
df

    Name  Score
0    Tom     75
1    Sam     95
2  James     98
3   Tina     74
4  Becca     80
5  Dessa     83
6   Lena     56

In [17]:
df.to_csv('cleaned_name_score.csv')

In [18]:
df['Score'].mean()

80.14285714285714